//Дано двухзначное число. Вывести на экран  вторую цифру числа с конца.

int a=4213;
int b=a/10;
int c=a/10%10;
System.Console.WriteLine(c);