//Дано двухзначное число. Вывести на экран  вторую цифру числа с конца.

int a=42134;
int b=a/10%10;
System.Console.WriteLine(b);